EParmar18/ECE-1188/Lab 5/CC3100BOOST_MQTT-TwitterLED_MSP432P401R/main.c
    strncpy(buf, data->topicName->lenstring.data,
        min(BUFF_SIZE, data->topicName->lenstring.len));
    buf[data->topicName->lenstring.len] = 0;



    strncpy(buf, data->message->payload,
        min(BUFF_SIZE, data->message->payloadlen));
    buf[data->message->payloadlen] = 0;

    tok = strtok(buf, " ");

    Tachometer_Get(&LeftTach[0], &LeftDir, &LeftSteps, &RightTach[0], &RightDir, &RightSteps);
    uint16_t ActualL = 2000000/avg(LeftTach, TACHBUFF);
    uint16_t ActualR = 2000000/avg(RightTach, TACHBUFF);
    if(*(tok) == 'g')
    {
        CLI_Write(" Go message \n\r");
        Motor_Forward(LeftDuty,RightDuty);
    }
    if(*(tok) == 's')
    {
//        CLI_Write(" Stop message \n\r");
//        P2->OUT &= ~0xC0;
//        P3->OUT &= ~0xC0;
//        P5->OUT &= ~0x30;
        Motor_Stop();
    }
    if(*(tok) == 'l')
    {
        int rc = 0;
                    MQTTMessage msg;
                    msg.dup = 0;
                    msg.id = 0;
                    sprintf(rpmL, "%d", ActualL);
                    char tmp[2] = "L";
                    strcat(rpmL,tmp);
                    msg.payload = rpmL;
                    msg.payloadlen = strlen(rpmL);
                    msg.qos = QOS0;
                    msg.retained = 0;
                    rc = MQTTPublish(&hMQTTClient, PUBLISH_TOPIC, &msg);
    }
    if(*(tok) == 'r')
        {
            int rc = 0;
                        MQTTMessage msg;
                        msg.dup = 0;
                        msg.id = 0;
                        rpmR[6] = 'r';
                        sprintf(rpmR, "%d", ActualR);
                        msg.payload = rpmR;
                        msg.payloadlen = log10(ActualR) + 2;
                        msg.qos = QOS0;
                        msg.retained = 0;
                        rc = MQTTPublish(&hMQTTClient, PUBLISH_TOPIC, &msg);
        }
    if(*(tok) == 'd')
        {
            if(pollDistanceSensor())
            {
              TimeToConvert = ((StartTime-SysTick->VAL)&0x00FFFFFF)/48000; // msec
              if(TxChannel <= 2)
              {
                SetCursor(6, TxChannel+1);
                OutUDec(Distances[TxChannel]);
              }
            }
            int rc = 0;
                        MQTTMessage msg;
                        msg.dup = 0;
                        msg.id = 0;
                        char dist[6];
                        dist[6] = 'd';
                        sprintf(dist, "%d", Distances[1]);
                        msg.payload = dist;
                        msg.payloadlen = log10(Distances[1]) + 2;
                        msg.qos = QOS0;
                        msg.retained = 0;
                        rc = MQTTPublish(&hMQTTClient, PUBLISH_TOPIC, &msg);
        }
//    color = strtol(tok, NULL, 10);
//    TA0CCR1 = PWM_PERIOD * (color/255.0);                 // CCR1 PWM duty cycle
//    tok = strtok(NULL, " ");
//    color = strtol(tok, NULL, 10);
//    TA0CCR2 = PWM_PERIOD * (color/255.0);                // CCR2 PWM duty cycle
//    tok = strtok(NULL, " ");
//    color = strtol(tok, NULL, 10);
//    TA0CCR3 = PWM_PERIOD * (color/255.0);                  // CCR3 PWM duty cycle

    return;
}

/*
 * Port 1 interrupt handler. This handler is called whenever the switch attached
 * to P1.1 is pressed.
 */
void PORT1_IRQHandler(void)
{
    uint32_t status = GPIO_getEnabledInterruptStatus(GPIO_PORT_P1);
    GPIO_clearInterruptFlag(GPIO_PORT_P1, status);

    if (status & GPIO_PIN1)
    {
        if (S1buttonDebounce == 0)
        {
            S1buttonDebounce = 1;

            GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);

            // Publish the unique ID
            publishID = 1;

            MAP_Timer_A_startCounter(TIMER_A1_BASE, TIMER_A_UP_MODE);
        }
    }
    if (status & GPIO_PIN4)
    {
        if (S2buttonDebounce == 0)
        {
            S2buttonDebounce = 1;

            CLI_Write(" MAC Address: \n\r ");
            CLI_Write(macStr);
            CLI_Write("\n\r");

            MAP_Timer_A_startCounter(TIMER_A1_BASE, TIMER_A_UP_MODE);
        }
    }
}

void TA1_0_IRQHandler(void)
{
    GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
    if (P1IN & GPIO_PIN1)
    {
        S1buttonDebounce = 0;
    }
    if (P1IN & GPIO_PIN4)
    {
        S2buttonDebounce = 0;
    }

    if ((P1IN & GPIO_PIN1) && (P1IN & GPIO_PIN4))
    {
        Timer_A_stopTimer(TIMER_A1_BASE);
    }
    MAP_Timer_A_clearCaptureCompareInterrupt(TIMER_A1_BASE,
                TIMER_A_CAPTURECOMPARE_REGISTER_0);
}


/*!
    \brief This function configure the SimpleLink device in its default state. It:
           - Sets the mode to STATION
           - Configures connection policy to Auto and AutoSmartConfig
           - Deletes all the stored profiles
           - Enables DHCP
           - Disables Scan policy
           - Sets Tx power to maximum
           - Sets power policy to normal
           - Unregisters mDNS services
           - Remove all filters

    \param[in]      none

    \return         On success, zero is returned. On error, negative is returned
*/
static _i32 configureSimpleLinkToDefaultState()
{
    SlVersionFull   ver = {0};
    _WlanRxFilterOperationCommandBuff_t  RxFilterIdMask = {0};

    _u8           val = 1;
    _u8           configOpt = 0;
    _u8           configLen = 0;
    _u8           power = 0;

    _i32          retVal = -1;
    _i32          mode = -1;

    mode = sl_Start(0, 0, 0);
    ASSERT_ON_ERROR(mode);

    /* If the device is not in station-mode, try configuring it in station-mode */
    if (ROLE_STA != mode)
    {
        if (ROLE_AP == mode)
        {
            /* If the device is in AP mode, we need to wait for this event before doing anything */
            while(!IS_IP_ACQUIRED(g_Status)) { _SlNonOsMainLoopTask(); }
        }

        /* Switch to STA role and restart */
        retVal = sl_WlanSetMode(ROLE_STA);
        ASSERT_ON_ERROR(retVal);

        retVal = sl_Stop(SL_STOP_TIMEOUT);
        ASSERT_ON_ERROR(retVal);

        retVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(retVal);

